notatki/android/android-zaliczenie.org
* Android
** activity                                                        :activity:
*** reprezentuje pojedynczy ekran zawierający interfej użytkownika
*** deklarowana w manifeście
*** koniecznie utworzenie obiektu intent                             :intent:
**** ważne dla interakcji pomiędzy aplikacjami
*** tworzenie i startowanie                                       :important:
**** tworzenie intent                                                :intent:
***** Intent intent = new Intent(this, Activity.class);              :intent:
**** uruchomienie activity
***** startActivity(intent)
***** startActivityForResult(intent)
****** analog okienka dialogowe (mniej więcej)
****** ponieważ java to choroba, jest to dziwne
******* Intent intent = new Intent(this, GroupActivity.class);
******* startActivityForResult(intent, CODE_ADD_GROUP_ACTIVITY);
******* przy powrocie wywołanie onActivityResult(int reqCode, int resCode, Intent i)
******** TODO reqCode
******** resCode
********* status wyniku (powodzenie == RESULT_OK)
**** Dodatkowe informacje przekazywane w intent
***** intent.putExtra("MAX_VALUE", 123);
*** cykl życia                                               :important:easy:
**** listenery
***** uruchomienie
****** onCreate()
******* przy tworzenie activity
******* inicjalizacja wszystkiego
****** onStart()
******* Wywołana przed wyświetleniem
****** onResume()
******* Wywołana przed rozpoczęciem interakcji
***** zmiana activity
****** onPause (dla aktywności ukrywanej)
******* Zapisanie danych, zatrzymanie działań.
****** onResume() (dla aktywności pokazywanej)
***** zatrzymanie activity
****** onStop()
******* Wywoływane gdy activity przestaje być widoczne.
***** Wznawianie zatrzymanej activity
****** onRestart()
****** onStart()
****** onResume()
***** Niszczenie activity
****** onStop() (wipierw zostanie zatrzymana i ukryta)
****** onDestroy() (następnie
** DONE Przechowywanie danych                                :important:easy:
   CLOSED: [2018-01-23 wto 19:15]
*** dla activity
**** przed przejściem activity do zniszczenia wywoływany jest callback onSaveInstanceState(Bundle bundle)
**** Bundle pozwala na przechowywanie stanu.
**** podczas przywracania wywoływane jest onRestoreInstanceState(Bundle bundle)
**** bundle przekazywane jest też do onCreate
**** istnieje też parcalable, ale nie należy go używać do przechowywania danych a jedynie do IPC
** DONE Activity i fragmenty                                      :important:
   CLOSED: [2018-01-24 śro 07:54]
*** fragmenty
**** reprezentują zachowanie części interfejsu w activity
**** mogą być wykorzystane ponownie w wielu activity
