notatki/android/android-zaliczenie.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-25 czw 08:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9846735">1. Android</a>
<ul>
<li><a href="#orgf83aaac">1.1. activity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="activity">activity</span></span></a>
<ul>
<li><a href="#orge2a0317">1.1.1. reprezentuje pojedynczy ekran zawierający interfej użytkownika</a></li>
<li><a href="#org3975700">1.1.2. deklarowana w manifeście</a></li>
<li><a href="#org31b88b6">1.1.3. koniecznie utworzenie obiektu intent&#xa0;&#xa0;&#xa0;<span class="tag"><span class="intent">intent</span></span></a></li>
<li><a href="#org34af3f9">1.1.4. tworzenie i startowanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#org3b47978">1.1.5. cykl życia&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a></li>
</ul>
</li>
<li><a href="#org8cd5309">1.2. <span class="done DONE">DONE</span> Przechowywanie danych&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a>
<ul>
<li><a href="#orgfdaff72">1.2.1. dla activity</a></li>
</ul>
</li>
<li><a href="#orgbac75b6">1.3. <span class="done DONE">DONE</span> Activity i fragmenty&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a>
<ul>
<li><a href="#org473e481">1.3.1. fragmenty</a></li>
</ul>
</li>
<li><a href="#org848d36d">1.4. <span class="done DONE">DONE</span> Czujniki i ich wykorzystanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a>
<ul>
<li><a href="#org9d93926">1.4.1. Zgodnie z https://developer.android.com/guide/topics/sensors/sensors_overview.html</a></li>
<li><a href="#orgfedb6ff">1.4.2. Typy</a></li>
<li><a href="#org185c3b0">1.4.3. Czujniki ruhchu</a></li>
<li><a href="#orga82bcf2">1.4.4. Czujniki pozycji</a></li>
<li><a href="#orgde25f6f">1.4.5. czujniki środowiskowe</a></li>
<li><a href="#orge84b61c">1.4.6. Wykorzystanie</a></li>
</ul>
</li>
<li><a href="#orgd159713">1.5. <span class="done DONE">DONE</span> Manifest i uprawnienia&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a>
<ul>
<li><a href="#orgbbf7207">1.5.1. plik xml dostarcza informacje o aplikacji dla androida</a></li>
<li><a href="#orge0ffc5b">1.5.2. zawiera</a></li>
<li><a href="#orgd3b844f">1.5.3. uprawnienia</a></li>
</ul>
</li>
<li><a href="#orgc3fa3aa">1.6. <span class="todo TODO">TODO</span> Kwalifikatory i ich zastosowanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a>
<ul>
<li><a href="#org67c12d1">1.6.1. aplikacja ma zasoby w folderze ref</a></li>
<li><a href="#org24cf547">1.6.2. następnie zasoby są przepisane do podkatalogu</a></li>
<li><a href="#org6089ab5">1.6.3. https://developer.android.com/guide/topics/resources/providing-resources.html</a></li>
</ul>
</li>
<li><a href="#org5e91ffb">1.7. <span class="done DONE">DONE</span> Wątki i async task&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a>
<ul>
<li><a href="#org08abb29">1.7.1. Broń boże nie próbować blokować wątku GUI.</a></li>
<li><a href="#org21a9363">1.7.2. private class DownloadFilesTask extends AsyncTask&lt;URL, Integer, Long&gt; {</a></li>
<li><a href="#org46a68e1">1.7.3. new DownloadFilesTask().execute(url1, url2, url3);</a></li>
<li><a href="#org473e647">1.7.4. dodatkowe metody</a></li>
<li><a href="#org3ea4053">1.7.5. parametry generyczne:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge91d6d8">2. iOS</a>
<ul>
<li><a href="#orga39cd63">2.1. <span class="todo TODO">TODO</span> Objective-C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="WTF">WTF</span></span></a>
<ul>
<li><a href="#org7289d45">2.1.1. Jeśli Objective-C to pytanie, odpowiedzią jest NIE.</a></li>
</ul>
</li>
<li><a href="#org4d3c09d">2.2. <span class="todo TODO">TODO</span> Zarządzanie pamięcią w Objective-C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a></li>
<li><a href="#orgcab4b92">2.3. <span class="done DONE">DONE</span> Podstawowe klasy systemowe (NSString, NSArray, NSDictionary, NSSet, &#x2026;)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></a>
<ul>
<li><a href="#org45396c8">2.3.1. stringi</a></li>
<li><a href="#orgd01abd2">2.3.2. array</a></li>
<li><a href="#orgc44d301">2.3.3. słowniki</a></li>
<li><a href="#org10df31a">2.3.4. sety</a></li>
</ul>
</li>
<li><a href="#org6962648">2.4. <span class="todo TODO">TODO</span> CoreData.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#orgb628e20">2.5. <span class="todo TODO">TODO</span> Storyboards.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#org2984979">2.6. <span class="todo TODO">TODO</span> Klasy mutable i non-mutable.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#orga227e1a">2.7. <span class="todo TODO">TODO</span> AppStore Guidelines.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#org000ff7f">2.8. <span class="todo TODO">TODO</span> Wykorzystanie Instruments (profiler).&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></a></li>
<li><a href="#orgbcad350">2.9. <span class="todo TODO">TODO</span> Wykorzystanie symulatora.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="WTF">WTF</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9846735" class="outline-2">
<h2 id="org9846735"><span class="section-number-2">1</span> Android</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf83aaac" class="outline-3">
<h3 id="orgf83aaac"><span class="section-number-3">1.1</span> activity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="activity">activity</span></span></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge2a0317" class="outline-4">
<h4 id="orge2a0317"><span class="section-number-4">1.1.1</span> reprezentuje pojedynczy ekran zawierający interfej użytkownika</h4>
</div>
<div id="outline-container-org3975700" class="outline-4">
<h4 id="org3975700"><span class="section-number-4">1.1.2</span> deklarowana w manifeście</h4>
</div>
<div id="outline-container-org31b88b6" class="outline-4">
<h4 id="org31b88b6"><span class="section-number-4">1.1.3</span> koniecznie utworzenie obiektu intent&#xa0;&#xa0;&#xa0;<span class="tag"><span class="intent">intent</span></span></h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="orgb59b1a1"></a>ważne dla interakcji pomiędzy aplikacjami<br /></li>
</ol>
</div>
<div id="outline-container-org34af3f9" class="outline-4">
<h4 id="org34af3f9"><span class="section-number-4">1.1.4</span> tworzenie i startowanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="orgc0a9f87"></a>tworzenie intent&#xa0;&#xa0;&#xa0;<span class="tag"><span class="intent">intent</span></span><br />
<ol class="org-ol">
<li><a id="org85e92e2"></a>Intent intent = new Intent(this, Activity.class);&#xa0;&#xa0;&#xa0;<span class="tag"><span class="intent">intent</span></span><br /></li>
</ol>
</li>
<li><a id="org36d3f59"></a>uruchomienie activity<br />
<ol class="org-ol">
<li><a id="orgfe454e4"></a>startActivity(intent)<br /></li>
<li><a id="org473a43d"></a>startActivityForResult(intent)<br />
<ol class="org-ol">
<li><a id="org5e26b97"></a>analog okienka dialogowe (mniej więcej)<br /></li>
<li><a id="org5c279e8"></a>ponieważ java to choroba, jest to dziwne<br />
<ol class="org-ol">
<li><a id="org2990627"></a>Intent intent = new Intent(this, GroupActivity.class);<br /></li>
<li><a id="org62634cc"></a>startActivityForResult(intent, CODE<sub>ADD</sub><sub>GROUP</sub><sub>ACTIVITY</sub>);<br /></li>
<li><a id="orgd8abde7"></a>przy powrocie wywołanie onActivityResult(int reqCode, int resCode, Intent i)<br />
<ol class="org-ol">
<li><a id="orgdaf0959"></a><span class="todo TODO">TODO</span> reqCode<br /></li>
<li><a id="org2eb8b7a"></a>resCode<br />
<ol class="org-ol">
<li><a id="orgf5582e4"></a>status wyniku (powodzenie == RESULT<sub>OK</sub>)<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orgbba71b3"></a>Dodatkowe informacje przekazywane w intent<br />
<ol class="org-ol">
<li><a id="org2c1e489"></a>intent.putExtra("MAX<sub>VALUE</sub>", 123);<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org3b47978" class="outline-4">
<h4 id="org3b47978"><span class="section-number-4">1.1.5</span> cykl życia&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h4>
<div class="outline-text-4" id="text-1-1-5">
</div>
<ol class="org-ol">
<li><a id="orgea41b9f"></a>listenery<br />
<ol class="org-ol">
<li><a id="orgd8628a8"></a>uruchomienie<br />
<ol class="org-ol">
<li><a id="orgead58f1"></a>onCreate()<br />
<ol class="org-ol">
<li><a id="org12335c7"></a>przy tworzenie activity<br /></li>
<li><a id="orge72170f"></a>inicjalizacja wszystkiego<br /></li>
</ol>
</li>
<li><a id="org43bc33e"></a>onStart()<br />
<ol class="org-ol">
<li><a id="orge9ef7c7"></a>Wywołana przed wyświetleniem<br /></li>
</ol>
</li>
<li><a id="org7162a8a"></a>onResume()<br />
<ol class="org-ol">
<li><a id="orgbfbbd4c"></a>Wywołana przed rozpoczęciem interakcji<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org0b2d832"></a>zmiana activity<br />
<ol class="org-ol">
<li><a id="org818fc0d"></a>onPause (dla aktywności ukrywanej)<br />
<ol class="org-ol">
<li><a id="org17dd5fe"></a>Zapisanie danych, zatrzymanie działań.<br /></li>
</ol>
</li>
<li><a id="org0880c5f"></a>onResume() (dla aktywności pokazywanej)<br /></li>
</ol>
</li>
<li><a id="org1c30af3"></a>zatrzymanie activity<br />
<ol class="org-ol">
<li><a id="org0bddacf"></a>onStop()<br />
<ol class="org-ol">
<li><a id="org59e5736"></a>Wywoływane gdy activity przestaje być widoczne.<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgf7de9d7"></a>Wznawianie zatrzymanej activity<br />
<ol class="org-ol">
<li><a id="orgb71ac5f"></a>onRestart()<br /></li>
<li><a id="org7590cf8"></a>onStart()<br /></li>
<li><a id="org898e04c"></a>onResume()<br /></li>
</ol>
</li>
<li><a id="orgc05e740"></a>Niszczenie activity<br />
<ol class="org-ol">
<li><a id="org49d85e5"></a>onStop() (wipierw zostanie zatrzymana i ukryta)<br /></li>
<li><a id="org6683b14"></a>onDestroy() (następnie<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org8cd5309" class="outline-3">
<h3 id="org8cd5309"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> Przechowywanie danych&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgfdaff72" class="outline-4">
<h4 id="orgfdaff72"><span class="section-number-4">1.2.1</span> dla activity</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orga52cdc9"></a>przed przejściem activity do zniszczenia wywoływany jest callback onSaveInstanceState(Bundle bundle)<br /></li>
<li><a id="org9928f26"></a>Bundle pozwala na przechowywanie stanu.<br /></li>
<li><a id="orgb59c2da"></a>podczas przywracania wywoływane jest onRestoreInstanceState(Bundle bundle)<br /></li>
<li><a id="org8d633e3"></a>bundle przekazywane jest też do onCreate<br /></li>
<li><a id="org619f8d1"></a>istnieje też parcalable, ale nie należy go używać do przechowywania danych a jedynie do IPC<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgbac75b6" class="outline-3">
<h3 id="orgbac75b6"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> Activity i fragmenty&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org473e481" class="outline-4">
<h4 id="org473e481"><span class="section-number-4">1.3.1</span> fragmenty</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org20a3d67"></a>reprezentują zachowanie części interfejsu w activity<br /></li>
<li><a id="org0207872"></a>mogą być wykorzystane ponownie w wielu activity<br /></li>
