notatki/android/android-zaliczenie.org
**** mogą być użyte w większej liczbie w jednym activity
**** posiada własny cykl życia
**** musi siedzieć w activity, ponieważ niczym u tasiemca, jego cykl życia jest powiązany z cyklem activity
**** gdy activity jeż działa (w stanie resumed) można swodobnie dodawać i usuwać fragmenty
**** tworzenie
***** subklasa Fragment
***** kod zbliżony do activity
****** onCreate
****** onStart
****** onPause
****** onStop
***** wbudowane fragmenty
****** DialogFragment
****** ListFragment
****** PreferenceFragmentCompat
***** ładowanie layoutu
       public static class ExampleFragment extends Fragment {
       @Override
       public View onCreateView(LayoutInflater inflater, ViewGroup container,
                                Bundle savedInstanceState) {
          // Inflate the layout for this fragment
          return inflater.inflate(R.layout.example_fragment, container, false);
          }
       }
****** argumenty inflate
******* ID
******* ViewGroup (rodzic)
******* boolean, informacja o tym czy fragment ma zostać dołączony do grupy w trakcie inflacji
***** dodawanie do aktywności
****** dodaj do pliku layoutu
****** ewentualnie można zrobić to programistycznie
******* FragmentManager fragmentManager = getSupportFragmentManager(); FragmentTransaction fragmentTransaction = fragmentManager.beginTransaction();
******* ExampleFragment fragment = new ExampleFragment();
        fragmentTransaction.add(R.id.fragment_container, fragment); //pierwszy argument to ViewGroup do którego ma zostać dodany fragment
        fragmentTransaction.addToBackStack(fragment);
        fragmentTransaction.commit();
****** pobranie activity
******* metoda call activity
****** pobranie dodanego fragmentu
******* ExampleFragment fragment = (ExampleFragment) getFragmentManager().findFragmentById(R.id.example_fragment);
** DONE Czujniki i ich wykorzystanie                              :important:
   CLOSED: [2018-01-23 wto 18:38]
*** Zgodnie z https://developer.android.com/guide/topics/sensors/sensors_overview.html
*** Typy
    | sensor                   | typ               | a co to robi?                                            |
    |--------------------------+-------------------+----------------------------------------------------------|
    | TYPE_ACCELEROMETER       | hardware          | przyśpieszenie w m/s^2 włącznie z siłą grawitacji        |
    | TYPE_AMBIENT_TEMPERATURE | hardware          | temperatura w stopniach Celsjusza                        |
    | TYPE_GRAVITY             | software/hardware | przyśpieszenie w m/s^2                                   |
    | TYPE_GYROSCOPE           | software/hardware | mierzy rotację we wszystkich osiach                      |
    | TYPE_LIGHT               | hardware          | światło w lx                                             |
    | TYPE_LINEAR_ACCELERATION | software/hardware | akcelerometr, pomija siłę grawitacji                     |
    | TYPE_MAGNETIC_FIELD      | hardware          | polę geomagnetyczne we wszystkich osiach w mikro Teslach |
    | TYPE_ORIENTATION         | software          | mierzy rotację. Potrafi obecnie zwrócić macierz rotacji. |
    | TYPE_PRESSURE            | hardware          | Mierzy ciśnienie w pascalach.                            |
    | TYPE_PROXIMITY           | hardware          | zbliżenie w cm od ekranu                                 |
    | TYPE_RELATIVE_HUMIDITY   | hardware          | wilgotność powietrza w %                                 |
    | TYPE_ROTATION_VECTOR     | software/hardware | W zasadzie to samo to orientacja?                        |
    | TYPE_TEMPERATURE         | hardware          | przestarzałe, używać TYPE_AMBIENT_TEMPERATURE            |
*** Czujniki ruhchu
**** mierzą siły wzdłuż trzech osi
**** akcelerometr
**** czujnik grawitacji
**** żyroskop
**** czujnik rotacji?
*** Czujniki pozycji
**** mierzą fizyczną pozycję urządzenia
**** czujnik orientacji (nie wiem jak ma działać)
**** magnetometr
*** czujniki środowiskowe
**** temperatura
**** ciśnienie
**** wilgotność i jaśność
*** Wykorzystanie
**** pobrać z SystemService SensorManager
**** pobrać z SensorManager instancję sensor
**** ((SensorManager)getSystemService(Context.SENSOR_SERVICE)).getDefaultSensor(Sensor.TYPE_ACCELEROMETER)...
**** List<Sensor> deviceSensors = mSensorManager.getSensorList(Sensor.TYPE_ALL) by zobaczyć jakie sensory są obecne.
**** można podłączyć się do sensora za pomocą SensorEventListener
**** SensorEvent
***** typ sensora
***** dokładność danych
***** timestamp
***** surowe dane
**** by korzystać z sensora potrzeba uprawnień.
** DONE Manifest i uprawnienia                               :important:easy:
   CLOSED: [2018-01-23 wto 19:08]
*** plik xml dostarcza informacje o aplikacji dla androida
*** zawiera
**** nazwa pakietu javy
**** opis komponentów aplikacji (activities, services, providers)
**** nazwy klas implementujące komponenty
**** procesy hostujące komponenty
**** deklarację uprawnień
**** wymagania odnośnie wersji
**** lista zależności (bibliotek)
*** uprawnienia
**** description (ludzki opis)
**** icon (obrazek)
**** label (ludzka nazwa)
**** name (nazwa kodowa)
