notatki/android/android-zaliczenie.html
<li><a id="org17966d7"></a>mogą być użyte w większej liczbie w jednym activity<br /></li>
<li><a id="org8fc8d18"></a>posiada własny cykl życia<br /></li>
<li><a id="org0f4f3b8"></a>musi siedzieć w activity, ponieważ niczym u tasiemca, jego cykl życia jest powiązany z cyklem activity<br /></li>
<li><a id="org6e2ba60"></a>gdy activity jeż działa (w stanie resumed) można swodobnie dodawać i usuwać fragmenty<br /></li>
<li><a id="org67ffdbe"></a>tworzenie<br />
<ol class="org-ol">
<li><a id="org724db01"></a>subklasa Fragment<br /></li>
<li><a id="orgea20eac"></a>kod zbliżony do activity<br />
<ol class="org-ol">
<li><a id="orgce97d77"></a>onCreate<br /></li>
<li><a id="org8f735d4"></a>onStart<br /></li>
<li><a id="org7a9161e"></a>onPause<br /></li>
<li><a id="org07b7c11"></a>onStop<br /></li>
</ol>
</li>
<li><a id="org378f95e"></a>wbudowane fragmenty<br />
<ol class="org-ol">
<li><a id="orgb8fef5a"></a>DialogFragment<br /></li>
<li><a id="org1c80929"></a>ListFragment<br /></li>
<li><a id="org582edfa"></a>PreferenceFragmentCompat<br /></li>
</ol>
</li>
<li><a id="org071fc3a"></a>ładowanie layoutu<br />
<div class="outline-text-6" id="text-1-3-1-7-4">
<p>
public static class ExampleFragment extends Fragment {
@Override
public View onCreateView(LayoutInflater inflater, ViewGroup container,
                         Bundle savedInstanceState) {
   // Inflate the layout for this fragment
   return inflater.inflate(R.layout.example<sub>fragment</sub>, container, false);
   }
}
</p>
</div>
<ol class="org-ol">
<li><a id="org7afb33e"></a>argumenty inflate<br />
<ol class="org-ol">
<li><a id="org5958883"></a>ID<br /></li>
<li><a id="orgf3bf4dc"></a>ViewGroup (rodzic)<br /></li>
<li><a id="org81767b2"></a>boolean, informacja o tym czy fragment ma zostać dołączony do grupy w trakcie inflacji<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgae1c205"></a>dodawanie do aktywności<br />
<ol class="org-ol">
<li><a id="orga7100a9"></a>dodaj do pliku layoutu<br /></li>
<li><a id="org574288e"></a>ewentualnie można zrobić to programistycznie<br />
<ol class="org-ol">
<li><a id="org7fbf7be"></a>FragmentManager fragmentManager = getSupportFragmentManager(); FragmentTransaction fragmentTransaction = fragmentManager.beginTransaction();<br /></li>
<li><a id="orgbaa52d4"></a>ExampleFragment fragment = new ExampleFragment();<br />
<div class="outline-text-8" id="text-1-3-1-7-5-2-2">
<p>
fragmentTransaction.add(R.id.fragment<sub>container</sub>, fragment); //pierwszy argument to ViewGroup do którego ma zostać dodany fragment
fragmentTransaction.addToBackStack(fragment);
fragmentTransaction.commit();
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgb7d181b"></a>pobranie activity<br />
<ol class="org-ol">
<li><a id="orga94b56f"></a>metoda call activity<br /></li>
</ol>
</li>
<li><a id="org2da0c1e"></a>pobranie dodanego fragmentu<br />
<ol class="org-ol">
<li><a id="org4610785"></a>ExampleFragment fragment = (ExampleFragment) getFragmentManager().findFragmentById(R.id.example<sub>fragment</sub>);<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org848d36d" class="outline-3">
<h3 id="org848d36d"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> Czujniki i ich wykorzystanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org9d93926" class="outline-4">
<h4 id="org9d93926"><span class="section-number-4">1.4.1</span> Zgodnie z <a href="https://developer.android.com/guide/topics/sensors/sensors_overview.html">https://developer.android.com/guide/topics/sensors/sensors_overview.html</a></h4>
</div>
<div id="outline-container-orgfedb6ff" class="outline-4">
<h4 id="orgfedb6ff"><span class="section-number-4">1.4.2</span> Typy</h4>
<div class="outline-text-4" id="text-1-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sensor</th>
<th scope="col" class="org-left">typ</th>
<th scope="col" class="org-left">a co to robi?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TYPE<sub>ACCELEROMETER</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">przyśpieszenie w m/s<sup>2</sup> włącznie z siłą grawitacji</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>AMBIENT</sub><sub>TEMPERATURE</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">temperatura w stopniach Celsjusza</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>GRAVITY</sub></td>
<td class="org-left">software/hardware</td>
<td class="org-left">przyśpieszenie w m/s<sup>2</sup></td>
</tr>

<tr>
<td class="org-left">TYPE<sub>GYROSCOPE</sub></td>
<td class="org-left">software/hardware</td>
<td class="org-left">mierzy rotację we wszystkich osiach</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>LIGHT</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">światło w lx</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>LINEAR</sub><sub>ACCELERATION</sub></td>
<td class="org-left">software/hardware</td>
<td class="org-left">akcelerometr, pomija siłę grawitacji</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>MAGNETIC</sub><sub>FIELD</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">polę geomagnetyczne we wszystkich osiach w mikro Teslach</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>ORIENTATION</sub></td>
<td class="org-left">software</td>
<td class="org-left">mierzy rotację. Potrafi obecnie zwrócić macierz rotacji.</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>PRESSURE</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">Mierzy ciśnienie w pascalach.</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>PROXIMITY</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">zbliżenie w cm od ekranu</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>RELATIVE</sub><sub>HUMIDITY</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">wilgotność powietrza w %</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>ROTATION</sub><sub>VECTOR</sub></td>
<td class="org-left">software/hardware</td>
<td class="org-left">W zasadzie to samo to orientacja?</td>
</tr>

<tr>
<td class="org-left">TYPE<sub>TEMPERATURE</sub></td>
<td class="org-left">hardware</td>
<td class="org-left">przestarzałe, używać TYPE<sub>AMBIENT</sub><sub>TEMPERATURE</sub></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org185c3b0" class="outline-4">
<h4 id="org185c3b0"><span class="section-number-4">1.4.3</span> Czujniki ruhchu</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org3c2c8d8"></a>mierzą siły wzdłuż trzech osi<br /></li>
<li><a id="orga87424c"></a>akcelerometr<br /></li>
<li><a id="org0c2d6ad"></a>czujnik grawitacji<br /></li>
<li><a id="org0ecef11"></a>żyroskop<br /></li>
<li><a id="org903b97d"></a>czujnik rotacji?<br /></li>
</ol>
</div>
<div id="outline-container-orga82bcf2" class="outline-4">
<h4 id="orga82bcf2"><span class="section-number-4">1.4.4</span> Czujniki pozycji</h4>
<div class="outline-text-4" id="text-1-4-4">
</div>
<ol class="org-ol">
<li><a id="org457289a"></a>mierzą fizyczną pozycję urządzenia<br /></li>
<li><a id="org68815d9"></a>czujnik orientacji (nie wiem jak ma działać)<br /></li>
<li><a id="orge5f5319"></a>magnetometr<br /></li>
</ol>
</div>
<div id="outline-container-orgde25f6f" class="outline-4">
<h4 id="orgde25f6f"><span class="section-number-4">1.4.5</span> czujniki środowiskowe</h4>
<div class="outline-text-4" id="text-1-4-5">
</div>
<ol class="org-ol">
<li><a id="org0caf631"></a>temperatura<br /></li>
<li><a id="org6eedb45"></a>ciśnienie<br /></li>
<li><a id="orgeb0c9bf"></a>wilgotność i jaśność<br /></li>
</ol>
</div>
<div id="outline-container-orge84b61c" class="outline-4">
<h4 id="orge84b61c"><span class="section-number-4">1.4.6</span> Wykorzystanie</h4>
<div class="outline-text-4" id="text-1-4-6">
</div>
<ol class="org-ol">
<li><a id="org0bba52a"></a>pobrać z SystemService SensorManager<br /></li>
<li><a id="org09721ed"></a>pobrać z SensorManager instancję sensor<br /></li>
<li><a id="orgd6459f2"></a>((SensorManager)getSystemService(Context.SENSOR<sub>SERVICE</sub>)).getDefaultSensor(Sensor.TYPE<sub>ACCELEROMETER</sub>)&#x2026;<br /></li>
<li><a id="orgdd52651"></a>List&lt;Sensor&gt; deviceSensors = mSensorManager.getSensorList(Sensor.TYPE<sub>ALL</sub>) by zobaczyć jakie sensory są obecne.<br /></li>
<li><a id="org9135531"></a>można podłączyć się do sensora za pomocą SensorEventListener<br /></li>
<li><a id="org91774c5"></a>SensorEvent<br />
<ol class="org-ol">
<li><a id="orga87ef8b"></a>typ sensora<br /></li>
<li><a id="org01be0fb"></a>dokładność danych<br /></li>
<li><a id="org2695f10"></a>timestamp<br /></li>
<li><a id="orgbe5ef68"></a>surowe dane<br /></li>
</ol>
</li>
<li><a id="org5c8e18c"></a>by korzystać z sensora potrzeba uprawnień.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgd159713" class="outline-3">
<h3 id="orgd159713"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> Manifest i uprawnienia&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgbbf7207" class="outline-4">
<h4 id="orgbbf7207"><span class="section-number-4">1.5.1</span> plik xml dostarcza informacje o aplikacji dla androida</h4>
</div>
<div id="outline-container-orge0ffc5b" class="outline-4">
<h4 id="orge0ffc5b"><span class="section-number-4">1.5.2</span> zawiera</h4>
<div class="outline-text-4" id="text-1-5-2">
</div>
<ol class="org-ol">
<li><a id="orga10bb65"></a>nazwa pakietu javy<br /></li>
<li><a id="orgb82c6c3"></a>opis komponentów aplikacji (activities, services, providers)<br /></li>
<li><a id="orgf91e796"></a>nazwy klas implementujące komponenty<br /></li>
<li><a id="orgf2036e8"></a>procesy hostujące komponenty<br /></li>
<li><a id="orgb1ac751"></a>deklarację uprawnień<br /></li>
<li><a id="orgc0a5cc4"></a>wymagania odnośnie wersji<br /></li>
<li><a id="org866c60a"></a>lista zależności (bibliotek)<br /></li>
</ol>
</div>
<div id="outline-container-orgd3b844f" class="outline-4">
<h4 id="orgd3b844f"><span class="section-number-4">1.5.3</span> uprawnienia</h4>
<div class="outline-text-4" id="text-1-5-3">
</div>
<ol class="org-ol">
<li><a id="orgb943763"></a>description (ludzki opis)<br /></li>
<li><a id="orgc06f74f"></a>icon (obrazek)<br /></li>
<li><a id="orgc4003a7"></a>label (ludzka nazwa)<br /></li>
<li><a id="org814d3c6"></a>name (nazwa kodowa)<br /></li>
