notatki/android/android-zaliczenie.org
**** permissionGroup (przypisanie uprawnienia do grupy)
**** protectionlevel
***** normal -- izolowany dostęp do funkcji apliakcji. Nie pyta użytkownika o zgodę.
***** dangerous -- dostęp do prywatnych danych. Może prosić o pozwolenie.
***** signature -- zezwala na dostęp aplikacjom podpisanym tym samym certyfikatem.
***** signatureOrSystem -- jak wyżej ale dodatkowo pozwala na dostęp aplikacjom systemowym.
** TODO Kwalifikatory i ich zastosowanie                          :important:
*** aplikacja ma zasoby w folderze ref
*** następnie zasoby są przepisane do podkatalogu
    | folder   | opis                                    |
    |----------+-----------------------------------------|
    | animator | P.XML typu property animations          |
    | anim     | P.XML typu tween animations             |
    | color    | P.XML definiuje listę kolorów           |
    | drawable | P.Bitmap                                |
    | mimap    | P. dla różnych gęstości ikon            |
    | layout   | P.XML definiuje layout                  |
    | menu     | P.XML definiuje menu                    |
    | raw      | P. do zapisu w raw formie               |
    | values   | Prote P. XML z string int colors arrays |
    | xml      | Pliki XML w ich środowisku              |
    | fonts    | Pliki czcionek                         |
*** https://developer.android.com/guide/topics/resources/providing-resources.html
** DONE Wątki i async task                                   :important:easy:
   CLOSED: [2018-01-24 śro 08:06]
*** Broń boże nie próbować blokować wątku GUI.
*** private class DownloadFilesTask extends AsyncTask<URL, Integer, Long> {
        protected Long doInBackground(URL... urls) {
             int count = urls.length;
             long totalSize = 0;
             for (int i = 0; i < count; i++) {
                 totalSize += Downloader.downloadFile(urls[i]);
                 publishProgress((int) ((i / (float) count) * 100));
                 // Escape early if cancel() is called
                 if (isCancelled()) break;
             }
             return totalSize;
          }

          protected void onProgressUpdate(Integer... progress) { //na wątku UI
              setProgressPercent(progress[0]);
          }

          protected void onPostExecute(Long result) { //na wątku UI
              showDialog("Downloaded " + result + " bytes");
          }
     }
*** new DownloadFilesTask().execute(url1, url2, url3);
*** dodatkowe metody
**** onCancelled()
**** onCancel()
**** onPreExecute
*** parametry generyczne:
**** co przyjmuje przy konstrukcji
**** co zwraca w ramach progress
**** co zwraca po wykonaniu
* iOS
** TODO Objective-C                                           :important:WTF:
*** Jeśli Objective-C to pytanie, odpowiedzią jest NIE.
** TODO Zarządzanie pamięcią w Objective-C                   :important:easy:
** DONE Podstawowe klasy systemowe (NSString, NSArray, NSDictionary, NSSet, ...) :important:easy:
   CLOSED: [2018-01-24 śro 07:57]
*** stringi
**** NSSstring -- niemutowalny string (UTF-16, możliwe utworzenie z UTF lub ascii)
**** NSMutableString -- mutowalny string (UTF-16, możliwe utworzenie z UTF lub ascii)
**** metody
***** compare
***** hash
***** isEqual
***** getCString
***** utf8String
***** length
***** write -- zapisz string do pliku (wtf?! why?).
*** array
**** NSArray -- stały, statyczny array
**** NSMutableArray -- dynamiczny array
***** dodatkowe metody
****** insert (rozsuń by zrobić miejsce, wsadź do środka)
****** add (dodaj na koniec)
**** NSPointerArray -- potrafi trzymać nil (yay!)
***** ma bardziej rozbudowane semantykę do obsługi pamięci (może być zainicjalizowane by trzymać weak pointery)
***** dodatkowe gówno-metody
****** insertPointer
****** addPointer
***** dodatkowo to co w mutable array
**** metody
***** count
***** contains
***** firstObject -- z początku array
***** lastObject -- na końcu array
***** subscript -- dereferencja elementu z array
***** index -- pozycja elementu w array
***** indexOfObject -- przyjmuje predykat, zwraca indeks pierwszego elementu dla którego predykat jest spełniony.
*** słowniki
**** mapuje stringi na obiekty
**** NSDictionary
**** NSMutableDictionary
***** dodatkowe metody
****** setValue
****** removeObject
**** metody
***** count
***** allKeys
***** allValues
***** value
*** sety
**** zbíór (obiekt albo w nim jest, albo go w nim nie ma).
**** NSSet
**** NSMutableSet
***** dodatkowe metody
****** union
****** minus
****** intersect
****** setSet
***** add
***** filter
***** remove
**** NSCountedSet
