notatki/android/android-zaliczenie.html
<li><a id="orgbaada1e"></a>permissionGroup (przypisanie uprawnienia do grupy)<br /></li>
<li><a id="orgae9e756"></a>protectionlevel<br />
<ol class="org-ol">
<li><a id="orga1b9cdd"></a>normal &#x2013; izolowany dostęp do funkcji apliakcji. Nie pyta użytkownika o zgodę.<br /></li>
<li><a id="org3903786"></a>dangerous &#x2013; dostęp do prywatnych danych. Może prosić o pozwolenie.<br /></li>
<li><a id="orgbfde6b7"></a>signature &#x2013; zezwala na dostęp aplikacjom podpisanym tym samym certyfikatem.<br /></li>
<li><a id="org0883d5b"></a>signatureOrSystem &#x2013; jak wyżej ale dodatkowo pozwala na dostęp aplikacjom systemowym.<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgc3fa3aa" class="outline-3">
<h3 id="orgc3fa3aa"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> Kwalifikatory i ich zastosowanie&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org67c12d1" class="outline-4">
<h4 id="org67c12d1"><span class="section-number-4">1.6.1</span> aplikacja ma zasoby w folderze ref</h4>
</div>
<div id="outline-container-org24cf547" class="outline-4">
<h4 id="org24cf547"><span class="section-number-4">1.6.2</span> następnie zasoby są przepisane do podkatalogu</h4>
<div class="outline-text-4" id="text-1-6-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">folder</th>
<th scope="col" class="org-left">opis</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">animator</td>
<td class="org-left">P.XML typu property animations</td>
</tr>

<tr>
<td class="org-left">anim</td>
<td class="org-left">P.XML typu tween animations</td>
</tr>

<tr>
<td class="org-left">color</td>
<td class="org-left">P.XML definiuje listę kolorów</td>
</tr>

<tr>
<td class="org-left">drawable</td>
<td class="org-left">P.Bitmap</td>
</tr>

<tr>
<td class="org-left">mimap</td>
<td class="org-left">P. dla różnych gęstości ikon</td>
</tr>

<tr>
<td class="org-left">layout</td>
<td class="org-left">P.XML definiuje layout</td>
</tr>

<tr>
<td class="org-left">menu</td>
<td class="org-left">P.XML definiuje menu</td>
</tr>

<tr>
<td class="org-left">raw</td>
<td class="org-left">P. do zapisu w raw formie</td>
</tr>

<tr>
<td class="org-left">values</td>
<td class="org-left">Prote P. XML z string int colors arrays</td>
</tr>

<tr>
<td class="org-left">xml</td>
<td class="org-left">Pliki XML w ich środowisku</td>
</tr>

<tr>
<td class="org-left">fonts</td>
<td class="org-left">Pliki czcionek</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6089ab5" class="outline-4">
<h4 id="org6089ab5"><span class="section-number-4">1.6.3</span> <a href="https://developer.android.com/guide/topics/resources/providing-resources.html">https://developer.android.com/guide/topics/resources/providing-resources.html</a></h4>
</div>
</div>
<div id="outline-container-org5e91ffb" class="outline-3">
<h3 id="org5e91ffb"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> Wątki i async task&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org08abb29" class="outline-4">
<h4 id="org08abb29"><span class="section-number-4">1.7.1</span> Broń boże nie próbować blokować wątku GUI.</h4>
</div>
<div id="outline-container-org21a9363" class="outline-4">
<h4 id="org21a9363"><span class="section-number-4">1.7.2</span> private class DownloadFilesTask extends AsyncTask&lt;URL, Integer, Long&gt; {</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
protected Long doInBackground(URL&#x2026; urls) {
     int count = urls.length;
     long totalSize = 0;
     for (int i = 0; i &lt; count; i++) {
         totalSize += Downloader.downloadFile(urls[i]);
         publishProgress((int) ((i / (float) count) * 100));
         // Escape early if cancel() is called
         if (isCancelled()) break;
     }
     return totalSize;
  }
</p>

<p>
protected void onProgressUpdate(Integer&#x2026; progress) { //na wątku UI
    setProgressPercent(progress[0]);
}
</p>

<p>
     protected void onPostExecute(Long result) { //na wątku UI
         showDialog("Downloaded " + result + " bytes");
     }
}
</p>
</div>
</div>
<div id="outline-container-org46a68e1" class="outline-4">
<h4 id="org46a68e1"><span class="section-number-4">1.7.3</span> new DownloadFilesTask().execute(url1, url2, url3);</h4>
</div>
<div id="outline-container-org473e647" class="outline-4">
<h4 id="org473e647"><span class="section-number-4">1.7.4</span> dodatkowe metody</h4>
<div class="outline-text-4" id="text-1-7-4">
</div>
<ol class="org-ol">
<li><a id="org2278280"></a>onCancelled()<br /></li>
<li><a id="org841f546"></a>onCancel()<br /></li>
<li><a id="orgabec3c0"></a>onPreExecute<br /></li>
</ol>
</div>
<div id="outline-container-org3ea4053" class="outline-4">
<h4 id="org3ea4053"><span class="section-number-4">1.7.5</span> parametry generyczne:</h4>
<div class="outline-text-4" id="text-1-7-5">
</div>
<ol class="org-ol">
<li><a id="org539ce87"></a>co przyjmuje przy konstrukcji<br /></li>
<li><a id="org9f5121a"></a>co zwraca w ramach progress<br /></li>
<li><a id="org1f845ef"></a>co zwraca po wykonaniu<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge91d6d8" class="outline-2">
<h2 id="orge91d6d8"><span class="section-number-2">2</span> iOS</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga39cd63" class="outline-3">
<h3 id="orga39cd63"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Objective-C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="WTF">WTF</span></span></h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org7289d45" class="outline-4">
<h4 id="org7289d45"><span class="section-number-4">2.1.1</span> Jeśli Objective-C to pytanie, odpowiedzią jest NIE.</h4>
</div>
</div>
<div id="outline-container-org4d3c09d" class="outline-3">
<h3 id="org4d3c09d"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Zarządzanie pamięcią w Objective-C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h3>
</div>
<div id="outline-container-orgcab4b92" class="outline-3">
<h3 id="orgcab4b92"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Podstawowe klasy systemowe (NSString, NSArray, NSDictionary, NSSet, &#x2026;)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org45396c8" class="outline-4">
<h4 id="org45396c8"><span class="section-number-4">2.3.1</span> stringi</h4>
<div class="outline-text-4" id="text-2-3-1">
</div>
<ol class="org-ol">
<li><a id="org85415b7"></a>NSSstring &#x2013; niemutowalny string (UTF-16, możliwe utworzenie z UTF lub ascii)<br /></li>
<li><a id="org7412ff8"></a>NSMutableString &#x2013; mutowalny string (UTF-16, możliwe utworzenie z UTF lub ascii)<br /></li>
<li><a id="org28a1dd7"></a>metody<br />
<ol class="org-ol">
<li><a id="org5078021"></a>compare<br /></li>
<li><a id="org1b025af"></a>hash<br /></li>
<li><a id="org9f3c319"></a>isEqual<br /></li>
<li><a id="org9e8259c"></a>getCString<br /></li>
<li><a id="org95710e5"></a>utf8String<br /></li>
<li><a id="org91ab520"></a>length<br /></li>
<li><a id="orgccd2dd1"></a>write &#x2013; zapisz string do pliku (wtf?! why?).<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgd01abd2" class="outline-4">
<h4 id="orgd01abd2"><span class="section-number-4">2.3.2</span> array</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ol class="org-ol">
<li><a id="org4e002d2"></a>NSArray &#x2013; stały, statyczny array<br /></li>
<li><a id="org96f5cec"></a>NSMutableArray &#x2013; dynamiczny array<br />
<ol class="org-ol">
<li><a id="orga251b1e"></a>dodatkowe metody<br />
<ol class="org-ol">
<li><a id="orgac6d0f7"></a>insert (rozsuń by zrobić miejsce, wsadź do środka)<br /></li>
<li><a id="org264ab81"></a>add (dodaj na koniec)<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgf8fa960"></a>NSPointerArray &#x2013; potrafi trzymać nil (yay!)<br />
<ol class="org-ol">
<li><a id="org997bc1e"></a>ma bardziej rozbudowane semantykę do obsługi pamięci (może być zainicjalizowane by trzymać weak pointery)<br /></li>
<li><a id="org87c190a"></a>dodatkowe gówno-metody<br />
<ol class="org-ol">
<li><a id="orgbfd2ec4"></a>insertPointer<br /></li>
<li><a id="org830857c"></a>addPointer<br /></li>
</ol>
</li>
<li><a id="org0a09659"></a>dodatkowo to co w mutable array<br /></li>
</ol>
</li>
<li><a id="org4a08f27"></a>metody<br />
<ol class="org-ol">
<li><a id="orgdcf99b6"></a>count<br /></li>
<li><a id="orgff1af86"></a>contains<br /></li>
<li><a id="org4f75b41"></a>firstObject &#x2013; z początku array<br /></li>
<li><a id="org3e0e119"></a>lastObject &#x2013; na końcu array<br /></li>
<li><a id="orgcb2e8b8"></a>subscript &#x2013; dereferencja elementu z array<br /></li>
<li><a id="orgc7bb94c"></a>index &#x2013; pozycja elementu w array<br /></li>
<li><a id="org8c8651b"></a>indexOfObject &#x2013; przyjmuje predykat, zwraca indeks pierwszego elementu dla którego predykat jest spełniony.<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgc44d301" class="outline-4">
<h4 id="orgc44d301"><span class="section-number-4">2.3.3</span> słowniki</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ol class="org-ol">
<li><a id="org35228c0"></a>mapuje stringi na obiekty<br /></li>
<li><a id="org59459ed"></a>NSDictionary<br /></li>
<li><a id="org5a40025"></a>NSMutableDictionary<br />
<ol class="org-ol">
<li><a id="org644a28e"></a>dodatkowe metody<br />
<ol class="org-ol">
<li><a id="orgb2cf3cd"></a>setValue<br /></li>
<li><a id="org2f450f3"></a>removeObject<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org2a408ee"></a>metody<br />
<ol class="org-ol">
<li><a id="org8e5ecc4"></a>count<br /></li>
<li><a id="orge5c0098"></a>allKeys<br /></li>
<li><a id="org12e1282"></a>allValues<br /></li>
<li><a id="orge406fe6"></a>value<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org10df31a" class="outline-4">
<h4 id="org10df31a"><span class="section-number-4">2.3.4</span> sety</h4>
<div class="outline-text-4" id="text-2-3-4">
</div>
<ol class="org-ol">
<li><a id="org6a23a67"></a>zbíór (obiekt albo w nim jest, albo go w nim nie ma).<br /></li>
