notatki/android/android-zaliczenie.org
***** mutowalny set, pozwala na wielokrotne dodanie tego samego elementu
***** dodatkowe mestody
****** count
**** metody
***** contains
***** filtered (tworzy set na podstawie istniejącego, zawierający jedynie elementy dla których predykat zwraca true).
***** member -- zwraca obiekt jeśli jest zawarty w zbiorze.
***** interects
***** isSubset
** TODO CoreData.                                                 :important:
** TODO Storyboards.                                              :important:
** TODO Klasy mutable i non-mutable.                              :important:
** TODO AppStore Guidelines.                                      :important:
** TODO Wykorzystanie Instruments (profiler).                     :important:
** TODO Wykorzystanie symulatora.                             :important:WTF:
