notatki/android/android-zaliczenie.html
<li><a id="org8d3e06d"></a>NSSet<br /></li>
<li><a id="orgc61e73c"></a>NSMutableSet<br />
<ol class="org-ol">
<li><a id="org5456403"></a>dodatkowe metody<br />
<ol class="org-ol">
<li><a id="org4f3822f"></a>union<br /></li>
<li><a id="orgc543708"></a>minus<br /></li>
<li><a id="orgc20e538"></a>intersect<br /></li>
<li><a id="org3a8a575"></a>setSet<br /></li>
</ol>
</li>
<li><a id="orgffd188e"></a>add<br /></li>
<li><a id="org5707729"></a>filter<br /></li>
<li><a id="org752003d"></a>remove<br /></li>
</ol>
</li>
<li><a id="org21bf7cb"></a>NSCountedSet<br />
<ol class="org-ol">
<li><a id="orgb49eae6"></a>mutowalny set, pozwala na wielokrotne dodanie tego samego elementu<br /></li>
<li><a id="orgb04a33b"></a>dodatkowe mestody<br />
<ol class="org-ol">
<li><a id="orgf67f88a"></a>count<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org538445c"></a>metody<br />
<ol class="org-ol">
<li><a id="org88c5032"></a>contains<br /></li>
<li><a id="orgcf56071"></a>filtered (tworzy set na podstawie istniejącego, zawierający jedynie elementy dla których predykat zwraca true).<br /></li>
<li><a id="org17caf13"></a>member &#x2013; zwraca obiekt jeśli jest zawarty w zbiorze.<br /></li>
<li><a id="org622e876"></a>interects<br /></li>
<li><a id="org30e4402"></a>isSubset<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org6962648" class="outline-3">
<h3 id="org6962648"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> CoreData.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
</div>
<div id="outline-container-orgb628e20" class="outline-3">
<h3 id="orgb628e20"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Storyboards.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
</div>
<div id="outline-container-org2984979" class="outline-3">
<h3 id="org2984979"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> Klasy mutable i non-mutable.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
</div>
<div id="outline-container-orga227e1a" class="outline-3">
<h3 id="orga227e1a"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> AppStore Guidelines.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
</div>
<div id="outline-container-org000ff7f" class="outline-3">
<h3 id="org000ff7f"><span class="section-number-3">2.8</span> <span class="todo TODO">TODO</span> Wykorzystanie Instruments (profiler).&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span></span></h3>
</div>
<div id="outline-container-orgbcad350" class="outline-3">
<h3 id="orgbcad350"><span class="section-number-3">2.9</span> <span class="todo TODO">TODO</span> Wykorzystanie symulatora.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="important">important</span>&#xa0;<span class="WTF">WTF</span></span></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-01-25 czw 08:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
